Repository: chabulhwi/chzzk-custom-css
Catalog: docs/omegat/project_save.tmx
Source language: en
Languages: ko

source: A screenshot of my entire screen with a customized Chzzk chat window on the right
ko: 제 전체 화면의 스크린 숏. 오른쪽에 사용자 지정이 된 치지직 채팅창이 있습니다.

source: Add a browser source to OBS whose URL is that of your Chzzk channel's chat window and custom CSS is chat_4k_uhd.css.
ko: 자신의 치지직 채널 채팅창을 브라우저 소스로 OBS에 추가하세요. chat_4k_uhd.css를 해당 브라우저 소스의 사용자 지정 CSS로 설정하시면 됩니다.

source: Add your Chzzk channel's chat window as a browser source to OBS whose custom CSS is chat_4k_uhd.css.
ko: 자신의 치지직 채널 채팅창을 브라우저 소스로 OBS에 추가하세요. 해당 브라우저 소스의 사용자 지정 CSS는 chat_4k_uhd.css이어야 됩니다.

source: Channel: https://chzzk.naver.com/7b15632e2d0107c85168e0b421aa6439
ko: 채널: https://chzzk.naver.com/7b15632e2d0107c85168e0b421aa6439

source: Channel: https://chzzk.naver.com/\<your-chzzk-channel\>
ko: 채널: https://chzzk.naver.com/\<치지직-채널\>

source: Channel: https://chzzk.naver.com/your-chzzk-channel
ko: 채널: https://chzzk.naver.com/치지직-채널

source: Chat: https://chzzk.naver.com/live/7b15632e2d0107c85168e0b421aa6439/chat
ko: 채팅창: https://chzzk.naver.com/live/7b15632e2d0107c85168e0b421aa6439/chat

source: Chat: https://chzzk.naver.com/live/\<your-chzzk-channel\>/chat
ko: 채팅창: https://chzzk.naver.com/live/\<치지직-채널\>/chat

source: Chat: https://chzzk.naver.com/live/your-chzzk-channel/chat
ko: 채팅창: https://chzzk.naver.com/live/치지직-채널/chat

source: Documentation
ko: 문서

source: English | 한국어[Korean]
ko: [English (영어)](./README.md) | 한국어

source: Feel free to replace them with the fonts you prefer.
ko: 원하시면 자신이 선호하는 글꼴로 바꿔 주세요.

source: For example, the URLs of my Chzzk channel and its chat window are as follows:
ko: 예를 들어, 제 치지직 채널과 그 채팅창의 URL은 각각 다음과 같습니다.

source: I added a black background with an opacity of 0.9 to each item in the chat list; the background has rounded corners with a radius of 24 pixels.
ko: 불투명도가 0.9인 검은 배경을 채팅 목록의 각 항목에 추가했습니다. 해당 배경의 둥근 모서리는 반지름이 24픽셀입니다.

source: I enlarged all elements except emoticons in the chat, subscription, and donation messages by a scale factor of 4.
ko: 이모티콘을 제외한, 채팅·구독·후원 메시지의 모든 요소는 4배 확대했습니다.

source: I enlarged all elements in the chat, subscription, and donation messages by a scale factor of 4.
ko: 채팅, 구독, 후원 메시지의 모든 요소를 4배 확대했습니다.

source: I use OmegaT to translate English documentation into Korean.
ko: 오메가T(OmegaT)를 이용해 영어 문서를 한국어로 번역했습니다.

source: License
ko: 이용 허가증

source: Screenshot
ko: 스크린 숏

source: The OmegaT project is in the docs directory.
ko: 오메가T 프로젝트는 docs 디렉터리에 있습니다.

source: The URL of your chat window
ko: 채팅창 URL

source: The URLs of your Chzzk channel and its chat window should have the following forms, respectively:
ko: 치지직 채널과 그 채팅창의 URL은 각각 다음과 같은 꼴로 돼 있습니다.

source: The file uses two fonts: Victor Mono and Noto Sans CJK KR.
ko: 이 CSS 파일에 이용된 글꼴은 빅터 모노(Victor Mono)와 노토 산(Noto Sans) CJK KR입니다.

source: The scale factor for the emoticons is 3.
ko: 이모티콘은 3배 확대했습니다.

source: This is a public domain work.
ko: 이 저작물은 자유 이용 저작물입니다.

source: This is the repository for my custom CSS file for a Chzzk chat window added as a browser source to OBS where the base (canvas) resolution is 3840 × 2160 (4K UHD).
ko: 이 저장소에 든 제 사용자 지정 CSS 파일은 치지직 채팅창을 브라우저 소스로 OBS에 추가할 때 활용할 수 있습니다. 단, 기본(캔버스) 해상도가 3840 × 2160 (4K UHD)이어야 됩니다.

source: This work is in the public domain.
ko: 이 저작물은 자유 이용 저작물입니다.

source: Usage
ko: 이용법

source: You need to install the Okapi filters plugin for OmegaT to make OmegaT parse Markdown files.
ko: 오메가T로 마크다운 파일을 구문 분석 하려면 오메가T를 위한 오카피(Okapi) 필터 플러그인을 설치해야 됩니다.
